
# 6.	Световен рекорд по плуване
# Иван решава да подобри Световния рекорд по плуване на дълги разстояния.
# На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,
current_record = float(input())
# разстоянието в метри, което трябва да преплува и времето в секунди,
distance = float(input())
# за което плува разстояние от 1 м. Да се напише програма, която изчислява дали се е справил със задачата,
seconds_per_meter = float(input())
# като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди.
resistance = (distance // 15) * 12.5
# Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
# резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд.


vreme = distance * seconds_per_meter + resistance


if vreme < current_record:
    print(f" Yes, he succeeded! The new world record is {vreme:.2f} seconds.")
# o	" Yes, he succeeded! The new world record is {времето на Иван} seconds."
else:
# •	Ако НЕ е подобрил рекорда (времето му е по-голямо или равно на рекорда) отпечатваме:
# o	"No, he failed! He was {недостигащите секунди} seconds slower."
    print(f"No, he failed! He was {vreme - current_record:.2f} seconds slower.")
# Резултатът трябва да се форматира до втория знак след десетичната запетая.
